#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Reference to undefined provider

  on main.tf line 27, in module "domain_management":
  27:     aws           = aws

There is no explicit declaration for local provider name "aws" in
module.domain_management, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.api.data.local_file.mock_response_get_files["featured_projects"]: Reading...
module.api.data.local_file.mock_response_get_files["about_page_content"]: Reading...
module.api.data.local_file.mock_response_get_files["about_page_content"]: Read complete after 0s [id=f7f34aa5c8b256b9b71d96324cb8e6b978c93d0a]
module.api.data.local_file.mock_response_get_files["featured_projects"]: Read complete after 0s [id=e32261d3c5c27bd4e8a1dd61ec4b12c695eae63f]
module.domain_management.aws_acm_certificate.thomaskimble_certificate_us_east_1: Refreshing state... [id=arn:aws:acm:us-east-1:287212251408:certificate/c84fb352-6443-4501-8dcd-7cef714df1d4]
module.frontend.data.aws_secretsmanager_secret.secret: Reading...
module.cdn.aws_cloudfront_origin_access_control.thomaskimble_origin_access_control: Refreshing state... [id=EL0VR2NKFTVMT]
module.domain_management.aws_route53_zone.thomaskimble: Refreshing state... [id=Z09261682MMR79C15BLZ9]
module.api.aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=ktjk0455h9]
module.domain_management.aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/36b7b09b-b03e-4036-8a14-dfd49c4e4fff]
module.storage.aws_s3_bucket.thomaskimble_bucket: Refreshing state... [id=thomaskimble-storage]
module.domain_management.aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_legacy_CNAME]
module.domain_management.aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z09261682MMR79C15BLZ9__TXT]
module.domain_management.aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z09261682MMR79C15BLZ9__MX]
module.domain_management.aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_autodiscover_CNAME]
module.domain_management.aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_email_CNAME]
module.frontend.data.aws_secretsmanager_secret.secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
module.frontend.data.aws_secretsmanager_secret_version.current: Reading...
module.api.aws_api_gateway_resource.mock_get_resources["featured_projects"]: Refreshing state... [id=kn1j9q]
module.api.aws_api_gateway_resource.mock_get_resources["about_page_content"]: Refreshing state... [id=8em389]
module.frontend.data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
module.frontend.aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d212nepszzoptn]
module.domain_management.aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.api.aws_api_gateway_domain_name.thomaskimble_api_gateway_domain_name: Refreshing state... [id=api.thomaskimble.com]
module.domain_management.aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z09261682MMR79C15BLZ9__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
module.api.aws_api_gateway_method.mock_get_methods["about_page_content"]: Refreshing state... [id=agm-ktjk0455h9-8em389-GET]
module.api.aws_api_gateway_method.options_methods["featured_projects"]: Refreshing state... [id=agm-ktjk0455h9-kn1j9q-OPTIONS]
module.api.aws_api_gateway_method.mock_get_methods["featured_projects"]: Refreshing state... [id=agm-ktjk0455h9-kn1j9q-GET]
module.api.aws_api_gateway_method.options_methods["about_page_content"]: Refreshing state... [id=agm-ktjk0455h9-8em389-OPTIONS]
module.domain_management.aws_route53_record.thomaskimble_api_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_api_A]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation_us_east_1: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.domain_management.aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=2024-05-15 15:03:21.971 +0000 UTC]
module.api.aws_api_gateway_method_response.mock_get_method_responses["featured_projects"]: Refreshing state... [id=agmr-ktjk0455h9-kn1j9q-GET-200]
module.api.aws_api_gateway_method_response.mock_get_method_responses["about_page_content"]: Refreshing state... [id=agmr-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["about_page_content"]: Refreshing state... [id=agir-ktjk0455h9-8em389-GET-200]
module.api.aws_api_gateway_integration.mock_get_integrations["about_page_content"]: Refreshing state... [id=agi-ktjk0455h9-8em389-GET]
module.api.aws_api_gateway_integration.mock_get_integrations["featured_projects"]: Refreshing state... [id=agi-ktjk0455h9-kn1j9q-GET]
module.api.aws_api_gateway_integration_response.mock_get_integration_responses["featured_projects"]: Refreshing state... [id=agir-ktjk0455h9-kn1j9q-GET-200]
module.frontend.aws_amplify_branch.dev: Refreshing state... [id=d212nepszzoptn/dev]
module.frontend.aws_amplify_branch.main: Refreshing state... [id=d212nepszzoptn/main]
module.api.aws_api_gateway_integration.options_integration["about_page_content"]: Refreshing state... [id=agi-ktjk0455h9-8em389-OPTIONS]
module.api.aws_api_gateway_integration.options_integration["featured_projects"]: Refreshing state... [id=agi-ktjk0455h9-kn1j9q-OPTIONS]
module.api.aws_api_gateway_method_response.options_method_response["about_page_content"]: Refreshing state... [id=agmr-ktjk0455h9-8em389-OPTIONS-200]
module.api.aws_api_gateway_method_response.options_method_response["featured_projects"]: Refreshing state... [id=agmr-ktjk0455h9-kn1j9q-OPTIONS-200]
module.api.aws_api_gateway_integration_response.options_integration_response["about_page_content"]: Refreshing state... [id=agir-ktjk0455h9-8em389-OPTIONS-200]
module.api.aws_api_gateway_integration_response.options_integration_response["featured_projects"]: Refreshing state... [id=agir-ktjk0455h9-kn1j9q-OPTIONS-200]
module.api.aws_api_gateway_deployment.api_deployment: Refreshing state... [id=734qwr]
module.api.aws_api_gateway_stage.thomaskimble_prod: Refreshing state... [id=ags-ktjk0455h9-prod]
module.frontend.aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d212nepszzoptn/thomaskimble.com]
module.api.aws_api_gateway_base_path_mapping.thomaskimble_api_gateway_mapping: Refreshing state... [id=api.thomaskimble.com/]
module.storage.aws_s3_bucket_ownership_controls.thomaskimble_bucket_acl_ownership: Refreshing state... [id=thomaskimble-storage]
module.storage.aws_s3_bucket_policy.thomaskimble_bucket_policy: Refreshing state... [id=thomaskimble-storage]
module.cdn.aws_cloudfront_distribution.thomaskimble_cloudfront_distribution: Refreshing state... [id=E1NVSILJBONNNS]
module.storage.aws_s3_bucket_acl.thomaskimble_bucket_acl: Refreshing state... [id=thomaskimble-storage,public-read]
module.domain_management.aws_route53_record.thomaskimble_storage_record: Refreshing state... [id=Z09261682MMR79C15BLZ9_storage_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.storage.aws_s3_object.create_paths["media"] will be created
  + resource "aws_s3_object" "create_paths" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thomaskimble-storage"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "media"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.storage.aws_s3_object.create_paths["projects"] will be created
  + resource "aws_s3_object" "create_paths" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "thomaskimble-storage"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "projects"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 27, in module "domain_management":
  27:     aws           = aws

There is no explicit declaration for local provider name "aws" in
module.domain_management, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*